rickymetz/esp32-hackathon/launcher/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s3"

# 16MB flash, QIO
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y

# ESP32-S3R8 has 8MB OCTAL PSRAM. OCT mode is NOT the IDF default --
# without it the PSRAM silently fails to initialise.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# Room for LVGL + Lua
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192
CONFIG_FREERTOS_HZ=1000

# lua_module_lvgl uses LVGL's Tiny TTF for runtime fonts
CONFIG_LV_USE_TINY_TTF=y
CONFIG_LV_TINY_TTF_FILE_SUPPORT=y

# I3: default is 64. Refresh's rebuild-before-delete briefly holds both the
# old and new launcher UI in this pool at once; with MAX_VISIBLE_ROWS capping
# rendered rows (launcher_main.c), peak usage is now well under the default
# too, but 128 buys real headroom for ~450B/row plus fragmentation. Internal
# DRAM has ~205 KB free at boot, so the extra 64 KB is affordable.
CONFIG_LV_MEM_SIZE_KILOBYTES=128

# I3: CONFIG_LV_USE_ASSERT_MALLOC's default handler (LV_ASSERT_HANDLER) is
# `while(1);` -- an lv_malloc() failure spins the calling task forever
# instead of returning NULL, and CONFIG_ESP_TASK_WDT_PANIC then turns that
# into a 10s-late whole-board panic. This symbol only controls the header
# `#include`d before the handler body; the handler body itself
# (CONFIG_LV_ASSERT_HANDLER) has no backing Kconfig entry -- confirmed by
# building with it set and finding it dropped with "unknown kconfig symbol"
# and absent from sdkconfig.h. The actual handler override lives in
# CMakeLists.txt / lv_assert_override.h as a force-included header instead.
CONFIG_LV_ASSERT_HANDLER_INCLUDE="esp_system.h"

# 14px (Montserrat 14, LVGL's built-in default) is ~7pt-equivalent on this
# panel's 2x scale -- under half watchOS's sanctioned 12pt minimum. 32px is
# the converged Apple/Wear body size at that scale; see docs/DESIGN_GUIDE.md.
CONFIG_LV_FONT_MONTSERRAT_24=y
CONFIG_LV_FONT_MONTSERRAT_26=y
CONFIG_LV_FONT_MONTSERRAT_32=y
CONFIG_LV_FONT_MONTSERRAT_40=y
CONFIG_LV_FONT_MONTSERRAT_48=y
CONFIG_LV_FONT_DEFAULT_MONTSERRAT_32=y

# App files on SD need real names, not 8.3. Without this, "weather_clock.lua"
# is invisible to the launcher.
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FATFS_MAX_LFN=255

# Custom partition table: the default 1MB app partition cannot fit
# LVGL + Lua + the LVGL bindings.
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Serial push needs an INPUT path. The USB-Serial/JTAG secondary console is
# output-only, so promote it to primary -- the board talks to the host over
# native USB, not UART0.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# A runaway app that the Lua hook cannot interrupt (a tight loop inside a C
# call, or inside a coroutine) must not wedge the board forever. Panic on
# watchdog so it reboots into a working launcher instead of warning every
# 5 seconds until someone power-cycles it.
CONFIG_ESP_TASK_WDT_PANIC=y
CONFIG_ESP_TASK_WDT_TIMEOUT_S=10

# Default is 1000000, so runaway recursion tries to allocate ~16 MB of Lua
# stack from PSRAM before raising "stack overflow" -- meaning the out-of-memory
# lands on some unrelated allocation first and the real cause is invisible.
CONFIG_LUA_MAXSTACK=65536
